function dp1(coins, amount) {
  let dp = new Array(amount + 1).fill(0)
  dp[0] = 1
  // for (let coin of arr) {
  //   for (let i = coin; i <= am; i++) {
  //     // console.log(coin)
  //     console.log([coin, i])
  //     // dp[]
  //     dp[i] = Math.min(dp[i - coin] + 1, dp[i])
  //   }
  // }
  // for (let i = 0; i < coins.length; i++) {
  //   // 遍历物品
  //   for (let j = coins[i]; j <= amount; j++) {
  //     // 遍历背包容量
  //     dp[j] += dp[j - coins[i]]
  //     console.log([i, j, coins[i]])
  //   }
  // }
  for (let j = 0; j <= amount; j++) {
    // 遍历背包容量

    for (let i = 0; i < coins.length; i++) {
      // 遍历物品
      // [1][2][5]
      if (j - coins[i] >= 0) dp[j] += dp[j - coins[i]]
      console.log([i, j, coins[i]])
    }
  }
  console.log(dp)
}

dp1([1, 2, 3], 3)
// [ 0, 0, 1 ]
// [ 1, 0, 2 ]
// [ 2, 0, 5 ]
// [ 0, 1, 1 ]
// [ 1, 1, 2 ]
// [ 2, 1, 5 ]
// [ 0, 2, 1 ]
// [ 1, 2, 2 ]
// [ 2, 2, 5 ]
// [ 0, 3, 1 ]
// [ 1, 3, 2 ]
// [ 2, 3, 5 ]
// [ 0, 4, 1 ]
// [ 1, 4, 2 ]
// [ 2, 4, 5 ]
// [ 0, 5, 1 ]
// [ 1, 5, 2 ]
// [ 2, 5, 5 ]
// [ 1, 1, 2, 3, 5, 9 ]

//   [(0, 1, 1)
// ][(0, 2, 1)][(0, 3, 1)][(0, 4, 1)][(0, 5, 1)][(1, 2, 2)][(1, 3, 2)][(1, 4, 2)][
//   (1, 5, 2)
// ][(2, 5, 5)][(1, 1, 2, 2, 3, 4)]

// amount = 5, coins = [1, 2, 5]
// 因为
// [11111]
// [221]
// [5]
// [1112]

// [111]
// [21]

// 9种
// 1          2
// [1] [11]  [2]
// 3
// [1,2]   [2,1]
// 4[22] [1111]
// 5
// [11111] [11111][11111][11111][111111]

// [221] [122] [212]

// [5]
